/******************************************************************************
说明:1.df.df导入系统
     2.xxbw230.p 运行一次产生browse
     3.号码范围维护 序号 ID: xpggroup 
     4.xxpgmt.p-相似组维护
     5.xxpgtmt.p-相似资料维护
     6.x.cim cim_load 到系统
     7.xxpgpr.i调用程序判断是否为相似组
     8.test.p测试程序
     
 rsqmt.p                      36.2.21.1 号码范围维护                  13/09/06
+--------------------------------- 排序主记录 ---------------------------------+
|            序号 ID: xpggroup                                                 |
|               描述: 相似组序号自动产生                                       |
|         目标数据集:                                                          |
|               内部: Yes                                                      |
|           允许放弃: Yes                           生效日期: 13/09/05         |
|           允许作废: Yes                           到期日期:                  |
+------------------------------------------------------------------------------+
+----------------------------------- 区段表 -----------------------------------+
|  号 类型     设置                                         控制               |
| --- -------- -------------------------------------------- --------           |
|   1 FIXED    gp                                                              |
|   2 INT      000001,999999,000001,000001                                     |
+------------------------------------------------------------------------------+
******************************************************************************/


{mfdeclre.i}
{xxpgpr.i}

   DEFINE VARIABLE vp1 LIKE pt_part INITIAL "1012N-001".
   DEFINE VARIABLE vp2 LIKE pt_part INITIAL "10DR10MX-04" NO-UNDO.
   DEFINE VARIABLE vd  LIKE pc_start NO-UNDO.
   DEFINE VARIABLE vo AS LOGICAL.

   RUN getlikeStat(INPUT vp1, INPUT vp2,INPUT DATE(5,20,2013) ,OUTPUT vo).

   DISPLAY vo.
